package com.paladin.health.data;

import java.io.IOException;
import java.io.Reader;
import java.io.StringReader;
import java.util.ArrayList;
import java.util.HashSet;
import java.util.List;

import com.chenlb.mmseg4j.ComplexSeg;
import com.chenlb.mmseg4j.Dictionary;
import com.chenlb.mmseg4j.MMSeg;
import com.chenlb.mmseg4j.Seg;
import com.chenlb.mmseg4j.Word;
import com.paladin.framework.utils.StringParser;

public class Tokenizer {

	protected Dictionary dic;
	protected Seg seg;

	private final static Tokenizer instance = new Tokenizer();

	public static Tokenizer getTokenizer() {
		return instance;
	}

	private Tokenizer() {
		dic = Dictionary.getInstance();
		seg = new ComplexSeg(dic);
	}

	public String segWords(Reader input, String wordSpilt) throws IOException {
		StringBuilder sb = new StringBuilder();
		MMSeg mmSeg = new MMSeg(input, seg);
		Word word = null;
		boolean first = true;
		while ((word = mmSeg.next()) != null) {
			if (!first) {
				sb.append(wordSpilt);
			}
			String w = word.getString();
			sb.append(w);
			first = false;
		}
		return sb.toString();
	}

	public List<String> segWords(Reader input) throws IOException {
		MMSeg mmSeg = new MMSeg(input, seg);
		Word word = null;
		List<String> result = new ArrayList<>();
		while ((word = mmSeg.next()) != null) {
			result.add(word.getString());
		}
		return result;
	}

	public String segWords(String txt, String wordSpilt) throws IOException {
		return segWords(new StringReader(txt), wordSpilt);
	}

	public List<String> segWords(String txt) throws IOException {
		return segWords(new StringReader(txt));
	}

	public static void main(String[] args) throws IOException {
		Tokenizer t = new Tokenizer();
		String str = "一般治疗,辨证论治,三尖瓣下移畸形一般治疗,征一般治疗,药物治疗,其他疗法,中医验方,其他,手术治疗,白塞病一般治疗,暴发性肝衰竭一般治疗,绝经一般治疗,绝经辨证论治,鼻疽假单胞菌肺炎一般治疗,玻璃体积血一般治疗,玻璃体积血辨证论治,包皮龟头炎一般治疗,包皮龟头炎辨证论治,霰粒肿一般治疗,霰粒肿辨证论治,弥漫性血管内凝血一般治疗,血栓闭塞性脉管炎一般治疗,血栓闭塞性脉管炎辨证论治,不孕症一般治疗,不孕症辨证论治,咽部硬结病一般治疗,过敏性血管炎一般治疗,过敏性血管炎辨证论治,乳腺癌一般治疗,乳腺癌辨证论治,小儿肠病性肢端皮炎一般治疗,病一般治疗,病辨证论治,蛔虫病一般治疗,蛔虫病辨证论治,口周皮炎一般治疗,口周皮炎辨证论治,小网膜囊疝一般治疗,孟氏骨折一般治疗,产后出血一般治疗,产后出血辨证论治,狐臭一般治疗,狐臭辨证论治,藏毛性疾病一般治疗,毛发囊肿一般治疗,急性乳腺炎一般治疗,急性乳腺炎辨证论治,泌乳素瘤一般治疗,泌乳素瘤辨证论治,黄水疮一般治疗,黄水疮辨证论治,蚕蚀性角膜溃疡一般治疗,蚕蚀性角膜溃疡辨证论治,损伤性休克一般治疗,丑角鱼鳞病一般治疗,垂体瘤一般治疗,胎位异常一般治疗,丘疹性荨麻疹一般治疗,肥胖症一般治疗,肥胖症辨证论治,单纯疱疹一般治疗,肾囊肿一般治疗,肾囊肿辨证论治,下肢静脉曲张一般治疗,小儿先天性胆总管囊肿一般治疗,咯血一般治疗,咯血辨证论治,颈椎先天融合畸形一般治疗,胆囊结石一般治疗,胆囊结石辨证论治,触电一般治疗,腮腺炎一般治疗,腮腺炎辨证论治,网膜肿瘤一般治疗,正常眼压性青光眼一般治疗,慢性胆囊炎一般治疗,慢性胆囊炎药物治疗,慢性胆囊炎手术治疗,慢性胆囊炎辨证论治,抽动秽语综合征一般治疗,短暂性脑缺血发作一般治疗,短暂性脑缺血发作辨证论治,二尖瓣关闭不全一般治疗,儿童自闭症一般治疗,恶性黑色素瘤一般治疗,恶性黑色素瘤辨证论治,肺吸虫病一般治疗,肺吸虫病辨证论治,肺大疱一般治疗,费尔蒂综合征一般治疗,青年痤疮一般治疗,青年痤疮辨证论治,腹股沟滑动疝一般治疗,特发性葡萄膜大脑炎一般治疗,特发性葡萄膜大脑炎辨证论治,功能性消化不良一般治疗,功能性消化不良辨证论治,分裂情感性障碍一般治疗,十二指肠旁疝一般治疗,挤奶者结节一般治疗,麻痹性斜视一般治疗,麻痹性斜视辨证论治,玫瑰糠疹一般治疗,玫瑰糠疹辨证论治,小舞蹈病一般治疗,小舞蹈病辨证论治,肺鼠疫一般治疗,肺鼠疫辨证论治,房性心动过速伴房室传导阻滞一般治疗,肺炎克雷白杆菌肺炎一般治疗,大叶性肺炎一般治疗,腓总神经损伤一般治疗,肱骨外科颈骨折一般治疗,肱骨外科颈骨折辨证论治,骨软骨瘤一般治疗,股骨粗隆间骨折一般治疗,股骨粗隆间骨折辨证论治,银屑病关节炎一般治疗,银屑病关节炎辨证论治,肛周脓肿一般治疗,肛周脓肿辨证论治,肺出血－肾炎综合征一般治疗,肺出血－肾炎综合征辨证论治,脓毒性休克一般治疗,多发性骨髓瘤辨证论治,高渗性非酮症糖尿病昏迷一般治疗,肝性血卟啉病综合征一般治疗,高脂血症一般治疗,干眼症一般治疗,干眼症辨证论治,冠心病一般治疗,冠心病药物治疗,冠心病手术治疗,冠心病中医验方,冠心病其他,肝损伤一般治疗,肝损伤辨证论治,混合性结缔组织病一般治疗,混合性结缔组织病辨证论治,维生素B2缺乏病一般治疗,黄色瘤一般治疗,脉络膜炎一般治疗,霍奇金淋巴瘤一般治疗,霍奇金淋巴瘤辨证论治,扁桃体周围脓肿一般治疗,亚硝酸盐中毒一般治疗,亚硝酸盐中毒辨证论治,肝吸虫病一般治疗,肝吸虫病辨证论治,瘰疬辨证论治,爆震性耳聋一般治疗,爆震性耳聋辨证论治,基底细胞癌一般治疗,基底细胞癌辨证论治,肩周炎一般治疗,肩周炎辨证论治,肺结核一般治疗,肺结核辨证论治,肠系膜淋巴结结核一般治疗,酒精伴发的精神障碍一般治疗,酒精伴发的精神障碍辨证论治,神经性肠梗阻综合症一般治疗,神经性肠梗阻综合症辨证论治,前斜角肌综合征一般治疗,弱智一般治疗,弱智辨证论治,巨细胞病毒感染症一般治疗,症一般治疗,浆细胞性包皮龟头炎一般治疗,感冒一般治疗,感冒药物治疗,感冒辨证论治,感冒中医验方,感冒其他,急性化脓性胆管炎一般治疗,ARDS一般治疗,急淋辨证论治,急性糜烂性胃炎一般治疗,恶性间皮瘤一般治疗,急性腰扭伤一般治疗,急性腰扭伤辨证论治,恶性青光眼一般治疗,恶性青光眼辨证论治,灰指甲一般治疗,灰指甲辨证论治,神经胶质瘤一般治疗,恐惧症一般治疗,恐惧症辨证论治,鹅口疮一般治疗,卡氏肺囊虫肺炎一般治疗,大骨节病一般治疗,大骨节病辨证论治,口蹄疫一般治疗,淋巴细胞脉络丛脑膜炎一般治疗,深脓疱病一般治疗,深脓疱病辨证论治,狼疮性肾炎一般治疗,瑞尔黑变病一般治疗,瑞尔黑变病辨证论治,地图舌一般治疗,地图舌辨证论治,朗格汉斯细胞组织细胞增生症一般治疗,流行性角结膜炎一般治疗,流行性角结膜炎辨证论治,流脑一般治疗,结核性苔藓一般治疗,结核性苔藓辨证论治,急性动脉栓塞一般治疗,腹主动脉瘤一般治疗,雷诺综合征一般治疗,雷诺综合征辨证论治,脑瘤一般治疗,脑瘤辨证论治,贾第虫病一般治疗,反应性关节炎一般治疗,咽异感症一般治疗,咽异感症辨证论治,面肌痉挛一般治疗,面瘫一般治疗,面瘫辨证论治,梅尼埃病一般治疗,梅尼埃病辨证论治,盲袢综合征一般治疗,慢性脓胸一般治疗,慢性淋巴细胞白血病一般治疗,慢性淋巴细胞性甲状腺炎一般治疗,慢性淋巴细胞性甲状腺炎辨证论治,慢性粒细胞白血病一般治疗,慢性粒细胞白血病辨证论治,慢性黏膜皮肤念珠菌病一般治疗,慢性肾炎一般治疗,慢性肾炎辨证论治,尿布疹一般治疗,尿布疹辨证论治,甲状腺相关眼病一般治疗,脑梗死一般治疗,诺卡菌病一般治疗,银屑病一般治疗,银屑病辨证论治,翼状胬肉一般治疗,翼状胬肉辨证论治,形成一般治疗,形成辨证论治,脑血吸虫病一般治疗,脑血吸虫病辨证论治,霉菌性阴道炎一般治疗,霉菌性阴道炎辨证论治,脑囊虫病一般治疗,脑囊虫病辨证论治,男性乳房肥大症一般治疗,男性乳房肥大症辨证论治,色素性化妆品皮炎一般治疗,硬皮病一般治疗,硬皮病辨证论治,扁平足一般治疗,生一般治疗,川崎病一般治疗,川崎病辨证论治,葡萄球菌性食物中毒一般治疗,情感障碍一般治疗,情感障碍辨证论治,少年性椎体骨软骨病一般治疗,强迫症一般治疗,强迫症辨证论治,心脏早搏　一般治疗,减压病一般治疗,Plummer-Vinson综合征一般治疗,脉痹辨证论治,热带口炎性腹泻一般治疗,神经型食物中毒一般治疗,良一般治疗,良辨证论治,痢疾后综合症一般治疗,软骨黏液样纤维瘤一般治疗,麦胶性肠病一般治疗,麦胶性肠病辨证论治,妊娠合并甲亢一般治疗,妊娠合并甲亢辨证论治,病毒性脑炎一般治疗,病毒性脑炎辨证论治,肾衰一般治疗,肾衰辨证论治,食管异物一般治疗,三尖瓣关闭不全一般治疗,神经性关节病一般治疗,神经性关节病辨证论治,成神经细胞瘤一般治疗,化脓性肉芽肿一般治疗,肾母细胞瘤一般治疗,肾母细胞瘤辨证论治,肾皮质化脓性感染一般治疗,肾脏损伤一般治疗,色素性紫癜性苔藓样皮病一般治疗,色素性紫癜性苔藓样皮病辨证论治,实体肿瘤的肾损害一般治疗,肾癌一般治疗,肾癌辨证论治,骨关节病一般治疗,痛风一般治疗,痛风药物治疗,痛风辨证论治,痛风中医验方,原发性癫痫一般治疗,突发性耳聋一般治疗,臀先露一般治疗,脱屑性间质肺炎一般治疗,遗传性球形红细胞增多症一般治疗,复发性溃疡一般治疗,复发性溃疡辨证论治,急性胃扩张一般治疗,急性胃扩张辨证论治,皮脂腺囊肿一般治疗,皮脂腺囊肿辨证论治,弯曲菌肠炎一般治疗,运动神经元病一般治疗,佝偻病一般治疗,佝偻病辨证论治,血吸虫尾蚴性皮炎一般治疗,血吸虫尾蚴性皮炎辨证论治,胃黏膜脱垂一般治疗,胃黏膜脱垂辨证论治,哮喘一般治疗,哮喘辨证论治,千日疮辨证论治,婴幼儿腹泻一般治疗,婴幼儿腹泻辨证论治,小儿蛔虫性肠梗阻一般治疗,小儿尿崩症一般治疗,小儿尿感一般治疗,小儿尿感辨证论治,小儿女性性早熟一般治疗,儿童糖尿病一般治疗,小儿先天性肾上腺皮质增生症一般治疗,小儿肺炎一般治疗,小儿肺炎辨证论治,小儿哮喘一般治疗,小儿哮喘辨证论治,心律不齐一般治疗,心律不齐辨证论治,心虚辨证论治,新生儿低体温一般治疗,性变态一般治疗,心脏神经官能症一般治疗,心脏神经官能症辨证论治,　一般治疗,白喉一般治疗,白喉辨证论治,流行性出血热一般治疗,流行性出血热辨证论治,腺样体肥大一般治疗,特应性皮炎一般治疗,特应性皮炎辨证论治,郎-奥韦综合征一般治疗,先天性耳前瘘管一般治疗,创伤后应激障碍一般治疗,眼睑丹毒一般治疗,眼睑丹毒辨证论治,子宫内膜间质肉瘤一般治疗,原发性胆汁性肝硬化一般治疗,原发性胆汁性肝硬化辨证论治,呕吐一般治疗,呕吐辨证论治,昏厥一般治疗,昏厥辨证论治,睑板腺癌一般治疗,睑板腺癌辨证论治,脊髓亚急性联合变性一般治疗,阴茎硬结症一般治疗,阴茎硬结症辨证论治,珍珠丘疹一般治疗,眼眶假瘤一般治疗,眼眶假瘤辨证论治,太田痣一般治疗,太田痣辨证论治,老花眼一般治疗,脱水一般治疗,胰瘘一般治疗,隐斜一般治疗,异位胰腺一般治疗,异装癖一般治疗,性病性淋巴肉芽肿一般治疗,性病性淋巴肉芽肿辨证论治,胃泌素瘤一般治疗,湿痹辨证论治,中间葡萄膜炎一般治疗,主动脉瓣关闭不全一般治疗,冬眠瘤一般治疗,椎管内结核肉芽肿一般治疗,　辨证论治,多汗症一般治疗,多汗症辨证论治,癔症一般治疗,癔症辨证论治,老年性黄斑变性一般治疗,周期性麻痹辨证论治,脂肪肉瘤一般治疗,着色真菌病一般治疗,着色真菌病辨证论治,肘外翻一般治疗,雪盲一般治疗";
		
		String[] arr = str.split(",");
		
		HashSet<String> set1 = new HashSet<>();
		HashSet<String> set2 = new HashSet<>();
			
		for(String s : arr) {		
			if(s.endsWith("治疗") || s.endsWith("辨证论治")) {
				set1.add(s.substring(s.length() - 4,s.length()));
			}else {
				set2.add(s);
			}
		}

//		List<String> result = t.segWords(str);
//		HashSet<String> set = new HashSet<>();
//		
//		for(String s : result) set.add(s);
		
		System.out.println(StringParser.toString(set1));
		System.out.println(StringParser.toString(set2));

	}

}
